# Terraform `environment` `prod`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c-c217a3ea-402f-4886-ace5-478db72ab4c9-cc75a1cc-d6a1-4530-828f-86832ce91b9b]
data.azuread_application_published_app_ids.well_known: Reading...
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
data.azuread_directory_object.current: Reading...
data.azuread_directory_object.current: Read complete after 0s [id=/directoryObjects/cc75a1cc-d6a1-4530-828f-86832ce91b9b]
data.azuread_service_principal.msgraph: Reading...
data.azuread_service_principal.current[0]: Reading...
data.azuread_service_principal.msgraph: Read complete after 0s [id=/servicePrincipals/b9d7b3d8-a063-4e34-89d9-15db56e22d42]
data.azuread_service_principal.current[0]: Read complete after 1s [id=/servicePrincipals/cc75a1cc-d6a1-4530-828f-86832ce91b9b]
data.azurerm_role_definition.contributor: Reading...
data.azurerm_role_definition.storage_blob_reader_data_access: Reading...
data.azurerm_role_definition.user_access_administrator: Reading...
data.azurerm_role_definition.storage_blob_data_owner: Reading...
data.azurerm_role_definition.azure_kubernetes_service_cluster_user_role: Reading...
data.azurerm_role_definition.azure_kubernetes_service_cluster_admin_role: Reading...
data.azurerm_role_definition.reader: Reading...
data.azurerm_role_definition.contributor: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c]
data.azurerm_resource_group.tfstate: Reading...
data.azurerm_subscription.current: Reading...
data.azurerm_role_definition.user_access_administrator: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9]
data.azurerm_role_definition.storage_blob_reader_data_access: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/c12c1c16-33a1-487b-954d-41c89c60f349]
data.azurerm_role_definition.storage_blob_data_owner: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b]
data.azurerm_role_definition.reader: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7]
data.azurerm_role_definition.azure_kubernetes_service_cluster_admin_role: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/0ab0b1a8-8aac-4efd-b8c2-3ee1fb270be8]
data.azurerm_role_definition.azure_kubernetes_service_cluster_user_role: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/4abbcc35-e782-43d8-92c5-2d3f1bd2253f]
data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2]
data.azurerm_resource_group.tfstate: Read complete after 1s [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_application.product["pap-altinn-altinn-platform-validation-tests-dev"] will be created
  + resource "azuread_application" "product" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "GitHub: altinn/altinn-platform-validation-tests - Dev"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # azuread_application.product["pap-altinn-altinn-platform-validation-tests-prod"] will be created
  + resource "azuread_application" "product" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "GitHub: altinn/altinn-platform-validation-tests - Prod"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # azuread_application.reader will be updated in-place
  ~ resource "azuread_application" "reader" {
        id                             = "/applications/f2259af8-0975-4e83-925f-3ccdf18da571"
        tags                           = []
        # (25 unchanged attributes hidden)

      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30" -> null
              - type = "Role" -> null
            }
          - resource_access {
              - id   = "5b567255-7703-4780-807c-7be8301ae99b" -> null
              - type = "Role" -> null
            }
        }

        # (6 unchanged blocks hidden)
    }

  # azuread_application_api_access.example_msgraph will be created
  + resource "azuread_application_api_access" "example_msgraph" {
      + api_client_id  = "00000003-0000-0000-c000-000000000000"
      + application_id = "/applications/005b1c70-6fa7-4205-9fa1-8b7a53713238"
      + id             = (known after apply)
      + role_ids       = [
          + "1bfefb4e-e0b5-418b-a88f-73c46d2cc8e9",
          + "62a82d76-70ea-41e2-9197-370581804d09",
        ]
    }

  # azuread_application_federated_identity_credential.oidc_branch["pap-altinn-altinn-platform-validation-tests-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_branch" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.branch.main"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.oidc_branch["pap-altinn-altinn-platform-validation-tests-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_branch" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.branch.main"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-validation-tests-dev-at21"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.environment.at21"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:environment:at21"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-validation-tests-dev-at22"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.environment.at22"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:environment:at22"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-validation-tests-dev-at23"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.environment.at23"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:environment:at23"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-validation-tests-dev-at24"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.environment.at24"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:environment:at24"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-validation-tests-dev-at25"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.environment.at25"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:environment:at25"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-validation-tests-dev-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.environment.dev"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:environment:dev"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-validation-tests-dev-grafana"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'grafana' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.environment.grafana"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:environment:grafana"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-validation-tests-dev-test"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.environment.test"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:environment:test"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-validation-tests-dev-yt01"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.environment.yt01"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:environment:yt01"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-validation-tests-prod-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.environment.prod"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:environment:prod"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-validation-tests-prod-staging"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.environment.staging"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:environment:staging"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-validation-tests-prod-tt02"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/Altinn/altinn-platform-validation-tests to have access to the app registration"
      + display_name   = "github.Altinn.altinn-platform-validation-tests.environment.tt02"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-platform-validation-tests:environment:tt02"
    }

  # azuread_service_principal.product["pap-altinn-altinn-platform-validation-tests-dev"] will be created
  + resource "azuread_service_principal" "product" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azuread_service_principal.product["pap-altinn-altinn-platform-validation-tests-prod"] will be created
  + resource "azuread_service_principal" "product" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_app_configuration.state will be updated in-place
  ~ resource "azurerm_app_configuration" "state" {
        id                                               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.AppConfiguration/configurationStores/altinnterraformappconf02"
        name                                             = "altinnterraformappconf02"
      ~ tags                                             = {
          - "costcenter" = "altinn3"
          - "createdAt"  = "09-07-2024 09:55:43 UTC"
          - "createdBy"  = "Bengt Rino Fredh"
          - "modifiedAt" = "01-09-2025 15:02:26 UTC"
          - "modifiedBy" = "GitHub: Altinn/altinn-platform - Admin"
          - "repository" = "github.com/Altinn/altinn-platform"
          - "solution"   = "platform"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # azurerm_role_assignment.appregg["pap-altinn-altinn-platform-validation-tests-dev"] will be created
  + resource "azurerm_role_assignment" "appregg" {
      + condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests/environments/dev'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests/environments/test'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests/environments/at21'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests/environments/at22'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests/environments/at23'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests/environments/at24'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests/environments/at25'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests/environments/yt01'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests/environments/grafana'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
             )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.appregg["pap-altinn-altinn-platform-validation-tests-prod"] will be created
  + resource "azurerm_role_assignment" "appregg" {
      + condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests/environments/staging'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests/environments/tt02'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests/environments/prod'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
             )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_contributor["pap-altinn-altinn-platform-validation-tests-dev"] will be created
  + resource "azurerm_role_assignment" "apps_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/PAP-Dev"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_contributor["pap-altinn-altinn-platform-validation-tests-prod"] will be created
  + resource "azurerm_role_assignment" "apps_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/PAP-Prod"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_user_access_administrator["pap-altinn-altinn-platform-validation-tests-dev"] will be created
  + resource "azurerm_role_assignment" "apps_user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/PAP-Dev"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_user_access_administrator["pap-altinn-altinn-platform-validation-tests-prod"] will be created
  + resource "azurerm_role_assignment" "apps_user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/PAP-Prod"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.products["pap-dev"] must be replaced
-/+ resource "azurerm_role_assignment" "products" {
      ~ condition                              = <<-EOT # forces replacement
            (
              (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
              OR
              (
                
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform'
                  OR
                
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/terraform-azurerm-altinn-modules'
                  OR
          +     
          +       @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests'
          +       OR
                      @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
              )
            )
        EOT
      ~ id                                     = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/d91e9b75-869f-b3a1-81a7-4deb966dd886" -> (known after apply)
      ~ name                                   = "d91e9b75-869f-b3a1-81a7-4deb966dd886" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.products["pap-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "products" {
      ~ condition                              = <<-EOT # forces replacement
            (
              (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
              OR
              (
                
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform'
                  OR
                
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/terraform-azurerm-altinn-modules'
                  OR
          +     
          +       @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-platform-validation-tests'
          +       OR
                      @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
              )
            )
        EOT
      ~ id                                     = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/5178e031-c1f3-aef8-f480-c5d479408ac8" -> (known after apply)
      ~ name                                   = "5178e031-c1f3-aef8-f480-c5d479408ac8" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_storage_account.backend will be updated in-place
  ~ resource "azurerm_storage_account" "backend" {
        id                                 = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02"
        name                               = "altinnterraformstorage02"
      ~ tags                               = {
          - "costcenter" = "altinn3"
          - "createdAt"  = "09-07-2024 09:55:43 UTC"
          - "createdBy"  = "Bengt Rino Fredh"
          - "modifiedAt" = "01-09-2025 15:02:26 UTC"
          - "modifiedBy" = "GitHub: Altinn/altinn-platform - Admin"
          - "repository" = "github.com/Altinn/altinn-platform"
          - "solution"   = "platform"
        } -> (known after apply)
        # (97 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 27 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/products` |
| State File | `github.com/altinn/altinn-platform/environments/prod/products.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_prod_products.tfstate.tfplan` |